content/history/501.md

Title: ［练习］用Python的httplib来测试C#写的WebServices是否正常
Date: 2010-11-11 22:31:40
Modified: 2010-11-11 22:31:40
Category: Program
Tags: Python,httplib,c#,webservices
Slug: 501
Authors: Yoker.Wu
Summary: 
    前几天接到一个短信接口的任务单，电信短信网关那边发来了一堆的wsdl描述文件，还有一堆req.xml，res.xml做测试。用C#来开发这个[WebServices](http://www.google.com/search?hl=zh-CN&q=webservices&client=pub-9809305251274649) ，再用C#来测试自然是没什么问题的。可这一对xml请求和相应文件怎么测试呢？也用c#来POST数据？太麻烦了，还是用python吧，我喜欢这个东西。
    运行下面的[Python](http://www.python.org)代码，如果通信不成功...


前几天接到一个短信接口的任务单，电信短信网关那边发来了一堆的wsdl描述文件，还有一堆req.xml，res.xml做测试。用C#来开发这个[WebServices](http://www.google.com/search?hl=zh-CN&q=webservices&client=pub-9809305251274649) ，再用C#来测试自然是没什么问题的。可这一对xml请求和相应文件怎么测试呢？也用c#来POST数据？太麻烦了，还是用python吧，我喜欢这个东西。

运行下面的[Python](http://www.python.org) 代码，如果通信不成功，webservices那边的异常信息会被回显在屏幕上，通信成功则直接执行完成。

```python
#!/usr/bin/env python
#coding=utf-8

import time,re,os
import httplib

host,port = '127.0.0.1',2197
header = {
    "Host" : host,
    "User-Agent" : "Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.2; Trident/4.0;)",
    "Connection":"Keep-Alive",
    "SOAPAction": "",
    "Referer" : "http://www.ct10000.com/"
    }
data = """<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns2="http://www.chinatelecom.com.cn/schema/ctcc/sms/v2_1"
 xmlns:ns3="http://www.chinatelecom.com.cn/schema/ctcc/common/v2_1"
 xmlns:ns7="http://www.chinatelecom.com.cn/wsdl/ctcc/sms/notification/v2_1/service"
 xmlns:ns1="http://www.chinatelecom.com.cn/schema/ctcc/sms/notification/v2_1/local"
 xmlns:ns8="http://www.chinatelecom.com.cn/wsdl/ctcc/sms/receive/v2_1/service"
 xmlns:ns4="http://www.chinatelecom.com.cn/schema/ctcc/sms/receive/v2_1/local">
 <SOAP-ENV:Header>
  <ns3:NotifySOAPHeader>
   <spRevId></spRevId>
   <spRevpassword></spRevpassword>
   <spId></spId>
   <SAN></SAN>
   <transactionId></transactionId>
   <linkId>12345678901234567890</linkId>
  </ns3:NotifySOAPHeader>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:notifySmsReception>
    <ns1:registrationIdentifier></ns1:registrationIdentifier>
    <ns1:message>
     <message></message>
     <senderAddress></senderAddress>
     <smsServiceActivationNumber></smsServiceActivationNumber>
    </ns1:message>
   </ns1:notifySmsReception>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>"""

conn = httplib.HTTPConnection(host,port=port)
conn.request("POST","/notifySmsReception.asmx",data, header)
resp=conn.getresponse()
s = resp.read()
print s.decode('utf-8')
```
